app/controllers/restaurants_controller.rb

DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]
---
    def destroy
        restaurant = find_restaurant
        restaurant.destroy

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_restaurant
        Restaurant.find(params[:id])