app/controllers/restaurant_pizzas_controller.rb

    def create
      restaurant_pizza = RestaurantPizza.new(restaurant_pizza_params)

      if restaurant_pizza.save
---
INSERT INTO "restaurant_pizzas" ("price", "restaurant_id", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 5], ["restaurant_id", 3], ["pizza_id", 1], ["created_at", "2023-03-20 21:03:58.867504"], ["updated_at", "2023-03-20 21:03:58.867504"]]